{"uri": "https://www.imdb.com/title/tt0072684/", "year": 1975, "movieTitle": "Barry Lyndon", "genre": "Adventure;Drama;History;War", "rating": 8.1, "posterUri": "https://m.media-amazon.com/images/M/MV5BNmY0MWY2NDctZDdmMi00MjA1LTk0ZTQtZDMyZTQ1NTNlYzVjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England.", "synopsis": "In the eighteenth century, in a small village in Ireland, Redmond Barry (Ryan O'Neal) is a young farm boy in love with his cousin Nora Brady (Gay Hamilton). When Nora gets engaged to British Captain John Quin (Leonard Rossiter), Barry challenges him to a duel of pistols. He wins and escapes to Dublin, but is robbed on the road. Without an alternative, Barry joins the British Army to fight in the Seven Years War. He deserts and is forced to join the Prussian Army, where he saves the life of his Captain and becomes his protégé and spy of Irish gambler Chevalier de Balibari (Patrick Magee). He helps Chevalier and becomes his associate until he decides to marry the wealthy Lady Lyndon (Marisa Berenson). They move to England and Barry, in his obsession of nobility, dissipates her fortune and makes a dangerous and revengeful enemy.", "director": "Stanley Kubrick", "writer": "Stanley Kubrick;William Makepeace Thackeray", "stars": "Ryan O'Neal;Marisa Berenson;Patrick Magee", "trivia": "Contrary to legend, this movie did use artificial lighting in some scenes (for example, when Bryan (David Morley) learns he's getting a horse). However, it is true that no electronic lighting was used for the candle-lit scenes. A lens built by the Carl Zeiss Company for N.A.S.A., a 50mm Zeiss lens modified with the Kollmorgen adaptor used in still cameras, was used to shoot scenes lit only by candle. This lens had the largest aperture of any ever built for movie use (f/0.7).", "languages": "English;German;French", "budget": 11000000, "runtime": 185}