{"uri": "https://www.imdb.com/title/tt0082096/", "year": 1981, "movieTitle": "Das Boot", "genre": "Adventure;Drama;Thriller;War", "rating": 8.3, "posterUri": "https://m.media-amazon.com/images/M/MV5BOGZhZDIzNWMtNjkxMS00MDQ1LThkMTYtZWQzYWU3MWMxMGU5XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "The claustrophobic world of a WWII German U-boat; boredom, filth and sheer terror.", "synopsis": "It is 1942 and the German submarine fleet is heavily engaged in the so-called \"Battle of the Atlantic\" to harass and destroy British shipping. With better escorts of the destroyer class, however, German U-boats have begun to take heavy losses. \"Das Boot\" is the story of the crew of one such U-Boat, with the film examining how these submariners maintained their professionalism as soldiers and attempted to accomplish impossible missions, all the while attempting to understand and obey the ideology of the government under which they served.", "director": "Wolfgang Petersen", "writer": "Wolfgang Petersen;Lothar G. Buchheim", "stars": "Jürgen Prochnow;Herbert Grönemeyer;Klaus Wennemann", "trivia": "The only surviving class IX U-Boat is in a Chicago museum, so a full-size floating replica of the exterior was built. Clever editing made this look like three different boats in the La Rochelle pens. Before filming began, it was used by Steven Spielberg for Raiders of the Lost Ark (1981). The replica comprised three sections, which started to break apart during filming at sea - in the scene following the crew singing \"It's A Long Way From Tipperary\", a crack can be seen between the first & second sections, midway between the gun which points forward and the crewman with his arms down. That night the replica was blown out to sea and destroyed, but enough parts were salvaged from the surrounding beaches to reconstruct about 2/3rds of the replica, though this now required some extra flotation devices.", "languages": "German", "budget": 32000000, "runtime": 149}