{"uri": "https://www.imdb.com/title/tt0363163/", "year": 2004, "movieTitle": "Der Untergang", "genre": "Biography;Drama;History;War", "rating": 8.2, "posterUri": "https://m.media-amazon.com/images/M/MV5BMTU0NTU5NTAyMl5BMl5BanBnXkFtZTYwNzYwMDg2._V1_UY268_CR0,0,182,268_AL_.jpg", "summary": "Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.", "synopsis": "In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.", "director": "Oliver Hirschbiegel", "writer": "Bernd Eichinger;Joachim Fest", "stars": "Bruno Ganz;Alexandra Maria Lara;Ulrich Matthes", "trivia": "The featured interview samples of real Traudl Junge are taken from the documentary \"Blind Spot\", recorded in April and July 2001. Due to serious health problems, Junge was unable to attend the film's premiere on February 9, 2002. The premiere had been a great success and the camera man went to the hospital to inform Junge, whereupon she is said to have answered, \"My life work is accomplished. Now I can let go.\" Just hours later, she died at age 82, after a long fight against cancer.", "languages": "German;Russian;French;English", "budget": 13500000, "runtime": 156}