{"uri": "https://www.imdb.com/title/tt0057012/", "year": 1964, "movieTitle": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb", "genre": "Comedy", "rating": 8.4, "posterUri": "https://m.media-amazon.com/images/M/MV5BZWI3ZTMxNjctMjdlNS00NmUwLWFiM2YtZDUyY2I3N2MxYTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "An insane general triggers a path to nuclear holocaust that a War Room full of politicians and generals frantically tries to stop.", "synopsis": "Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an all ...", "director": "Stanley Kubrick", "writer": "Stanley Kubrick;Terry Southern", "stars": "Peter Sellers;George C. Scott;Sterling Hayden", "trivia": "Based on the novel \"Red Alert\" by Peter George, and originally conceived as a tense thriller about the possibility of accidental nuclear war. Stanley Kubrick was working on the script when he realized that many scenes he had written were actually quite funny. He then brought in Terry Southern to turn the story into a satire. Among the changes were the addition of the title character and the renaming of other characters using satirical names such as Turgidson, Kissoff, Guano, DeSadesky, and Merkin Muffley.", "languages": "English;Russian", "budget": 1800000, "runtime": 95}