{"uri": "https://www.imdb.com/title/tt3417422/", "year": 2013, "movieTitle": "Drishyam", "genre": "Crime,Drama,Thriller", "rating": 8.3, "posterUri": "https://m.media-amazon.com/images/M/MV5BYmY3MzYwMGUtOWMxYS00OGVhLWFjNmUtYzlkNGVmY2ZkMjA3XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY268_CR11,0,182,268_AL_.jpg", "summary": "A man goes to extreme lengths to save his family from punishment after the family commits an accidental crime.", "synopsis": "Georgekutty (Mohanlal) is a cable TV network owner in a remote and hilly village in Kerala. He lives a happy life with his wife and 2 girls. The first half revolves around the depiction of their happy family. Anju (Ansiba), Georgekutty's daughter goes to a school trip in between the proceedings. After a few days a guy who had been at the school trip with her meets Anju. He blackmails her with a video of her that he had captured during the school trip. In the course of events he is accidentally killed by Rani (Meena) and Anju. Georgekutty on returning home is appraised of the events and thus begins a cat and mouse game as the murdered person is the son of IG Geeta Prabhakar (Asha Sharath) and Prabhakar (Siddique). How the family weathers the storm that ensues during the murder investigation forms the rest of the story leading to a deeply satisfying and unexpected climax.", "director": "Jeethu Joseph", "writer": "Jeethu Joseph", "stars": "Mohanlal,Meena,Asha Sharath", "trivia": "Drishyam was first remade in Kannada as Drishya (2014) by P. Vasu. The Telugu version titled Drushyam (2014) directed by Sripriya featured Meena reprising her role. Jeethu Joseph himself directed the Tamil remake Papanasam (2015). A Hindi remake was also made with the same name in 2015, directed by Nishikant Kamat. All these versions were commercially successful. It was also remade in Sinhala as Dharmayuddhaya, directed by Cheyyar Ravi. Drishyam is also the first Indian film to have a remake in Chinese, titled Sheep Without a Shepherd (2019).", "languages": "Malayalam", "budget": 35000000}