{"uri": "https://www.imdb.com/title/tt0038650/", "year": 1946, "movieTitle": "It's a Wonderful Life", "genre": "Drama;Family;Fantasy", "rating": 8.6, "posterUri": "https://m.media-amazon.com/images/M/MV5BZjc4NDZhZWMtNGEzYS00ZWU2LThlM2ItNTA0YzQ0OTExMTE2XkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_UY268_CR1,0,182,268_AL_.jpg", "summary": "An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.", "synopsis": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his ...", "director": "Frank Capra", "writer": "Frances Goodrich;Albert Hackett", "stars": "James Stewart;Donna Reed;Lionel Barrymore", "trivia": "The newspaper Bert the Cop is holding when George asks Ernie the cab driver for a ride, has the headline \"Smith Wins Nomination\", possibly referring to Frank Capra's and James Stewart's previous film, Mr. Smith Goes to Washington (1939). It could also have referred to Governor Al Smith's winning of the Democratic Party's Presidential nomination in 1928, which would fit with the time line of the film.", "languages": "English;French", "budget": 3180000, "runtime": 130}