{"uri": "https://www.imdb.com/title/tt0053125/", "year": 1959, "movieTitle": "North by Northwest", "genre": "Adventure;Mystery;Thriller", "rating": 8.3, "posterUri": "https://m.media-amazon.com/images/M/MV5BZDA3NDExMTUtMDlhOC00MmQ5LWExZGUtYmI1NGVlZWI4OWNiXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A New York City advertising executive goes on the run after being mistaken for a government agent by a group of foreign spies.", "synopsis": "Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore.", "director": "Alfred Hitchcock", "writer": "Ernest Lehman", "stars": "Cary Grant;Eva Marie Saint;James Mason", "trivia": "In numerous interviews, Martin Landau said that he made a decision on his own to play the character of Leonard as gay and in love with Phillip Vandamm. In an October 2012 interview with Devin Faraci, Landau said that he was cast in this movie when Alfred Hitchcock \"saw me in a play called 'Middle of the Night', Paddy Chayefsky's first Broadway play, with Edward G. Robinson, which I toured with after the Broadway run. He was there opening night. I played a very macho guy, one hundred eighty degrees from Leonard, who I chose to play as a homosexual, very subtly. Because he wanted to get rid of Eva Marie Saint with such a vengeance. James Mason, to the day he died, he became a friend of mine, the most often asked question of James was whether Vandamm, his character, was bisexual. He said, 'No he wasn't, but Landau made a choice, and there's nothing I can do about it.' I actually caused him some grief. Everyone told me not to do that because it was my first big movie and people would think I was gay. I'm an actor. I said it wasn't going to be my last movie, and it certainly wasn't. I've never played a character like that since. I also felt it was something people would know or not know. It was very subtle. I thought, 'in Boise, Idaho they might not notice.'\" Landau also said that after he made the decision to play Leonard as gay, Hitchcock and Screenwriter Ernest Lehman were very supportive of the idea. \"Ernie Lehman added a line which was not in the script. 'Call it my woman's intuition' was not in the original script. It was a very daring line for the 1950s. Men didn't say things like that. Hitchcock loved what I did, and left me alone.\"", "languages": "English;French", "budget": 3101000, "runtime": 136}