{"uri": "https://www.imdb.com/title/tt0103064/", "year": 1991, "movieTitle": "Terminator 2: Judgment Day", "genre": "Action,Sci-Fi", "rating": 8.5, "posterUri": "https://m.media-amazon.com/images/M/MV5BMGU2NzRmZjUtOGUxYS00ZjdjLWEwZWItY2NlM2JhNjkxNTFmXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son, John Connor, from a more advanced and powerful cyborg.", "synopsis": "Over 10 years have passed since the first machine called The Terminator tried to kill Sarah Connor and her unborn son, John. The man who will become the future leader of the human resistance against the Machines is now a healthy young boy. However, another Terminator, called the T-1000, is sent back through time by the supercomputer Skynet. This new Terminator is more advanced and more powerful than its predecessor and its mission is to kill John Connor when he's still a child. However, in the Internet and John do not have to face the threat of the T-1000 alone. Another Terminator (identical to the same model that tried and failed to kill Sarah Connor in 1984) is also sent back through time to protect them. Now, the battle for tomorrow has begun.", "director": "James Cameron", "writer": "James Cameron,William Wisher", "stars": "Arnold Schwarzenegger,Linda Hamilton,Edward Furlong", "trivia": "James Cameron fought over the ending with Mario Kassar. Cameron wanted to end the film with an alternate Coda Ending (that showed the older Sarah in future) as a bookend, but Kassar wanted to end the film in an another way (as a measure for possible sequels), and demanded a test screening. Cameron eventually relented when test audiences and Kassar himself reacted negatively over the coda ending, commenting that it was way too positive compared to bleak and dark tone of the rest of the movie, and almost seemed to come from a different movie. He chose the more ambiguous existing ending, arguing that it didn't let the audience off the hook so easily, and implying that the struggle for the future is an ongoing one.", "languages": "English,Spanish", "budget": 102000000, "runtime": 137}