{"uri": "https://www.imdb.com/title/tt0093779/", "year": 1987, "movieTitle": "The Princess Bride", "genre": "Adventure,Family,Fantasy,Romance", "rating": 8.1, "posterUri": "https://m.media-amazon.com/images/M/MV5BMGM4M2Q5N2MtNThkZS00NTc1LTk1NTItNWEyZjJjNDRmNDk5XkEyXkFqcGdeQXVyMjA0MDQ0Mjc@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "While home sick in bed, a young boy's grandfather reads him the story of a farmboy-turned-pirate who encounters numerous obstacles, enemies and allies in his quest to be reunited with his true love.", "synopsis": "An elderly man reads the book \"The Princess Bride\" to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he prefers something with lots of action and \"no kissing\", but he lets grandfather continue, because he doesn't want to hurt his feelings. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of \"as you wish\" to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a...", "director": "Rob Reiner", "writer": "William Goldman,William Goldman", "stars": "Cary Elwes,Mandy Patinkin,Robin Wright", "trivia": "Before filming, Wallace Shawn (Vizzini) had come to understand that he was second choice for the part after Danny DeVito (although there is some confusion about whether DeVito was ever seriously pursued). He became convinced that he was wrong for the role and in danger of being fired at any moment. He was extremely nervous throughout filming and co-star Cary Elwes (Westley) noted that he was visibly sweating during the 'battle of wits' scene. He said to Rob Reiner that he didn't feel he'd get the part because he isn't Sicilian; Rob assured him that his voice was exactly the same as Vizzini's in the book.", "languages": "English", "budget": 16000000, "runtime": 98}