{"uri": "https://www.imdb.com/title/tt0080678/", "year": 1980, "movieTitle": "The Elephant Man", "genre": "Biography;Drama", "rating": 8.1, "posterUri": "https://m.media-amazon.com/images/M/MV5BMDVjNjIwOGItNDE3Ny00OThjLWE0NzQtZTU3YjMzZTZjMzhkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A Victorian surgeon rescues a heavily disfigured man who is mistreated while scraping a living as a side-show freak. Behind his monstrous façade, there is revealed a person of kindness, intelligence and sophistication.", "synopsis": "In Victorian London, Dr. Frederick Treves with the London Hospital comes across a circus sideshow attraction run by a man named Bytes called \"The Elephant Man\". In actuality, the creature on display is indeed a man, twenty-one-year-old Joseph \"John\" Merrick, who has several physical deformities, including an oversized and disfigured skull, and an oversized and disfigured right shoulder. Brutish Bytes, his \"owner\", only wants whatever he can get economically by presenting Merrick as a freak. Treves manages to bring Merrick under his care at the hospital, not without several of its own obstacles, including being questioned by those in authority since Merrick cannot be cured. Treves initially believes Bytes' assertion that mute Merrick is an imbecile, but ultimately learns that Merrick can speak and is a well-read and articulate man. As news of Merrick hits the London newspapers, he becomes a celebrated curiosity amongst London's upper class, including with Mrs. Kendal, a famed actress. ...", "director": "David Lynch", "writer": "Christopher De Vore;Eric Bergren", "stars": "Anthony Hopkins;John Hurt;Anne Bancroft", "trivia": "In this movie, Joseph \"John\" Merrick constructs his cardboard cathedral from scraps he finds in the trash. He based his design on a view of St. Philips Church from his window. Actually, Merrick's rooms in Bedstead Square were around the corner from the church. Also, the real Merrick assembled his church from a prefab kit of Mainz Cathedral, Germany. However, it's a very difficult model with a lot of tiny pieces. Joseph's work is still a miracle, as he could only use his left hand and primitive tools. (It took a modern kit builder seventeen solid hours to assemble one, using both hands and modern tools.) Joseph \"John\" Merrick's beautiful cathedral can still be seen at the Royal London Museum Archives, ironically in the basement of St. Philips.", "languages": "English;French", "budget": 5000000, "runtime": 124}