{"uri": "https://www.imdb.com/title/tt0120737/", "year": 2001, "movieTitle": "The Lord of the Rings: The Fellowship of the Ring", "genre": "Action,Adventure,Drama,Fantasy", "rating": 8.8, "posterUri": "https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.", "synopsis": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign.", "director": "Peter Jackson", "writer": "J.R.R. Tolkien,Fran Walsh", "stars": "Elijah Wood,Ian McKellen,Orlando Bloom", "trivia": "One of the more interesting but oft-overlooked parts of the genesis of The Lord of the Rings trilogy is the time in the 90s when Peter Jackson's vision was set to be produced by Harvey Weinstein. But that was going to be a cheap, two-movie version that would have been called The Fellowship of the Ring and The War of the Ring. Jackson knew that wouldn't work so he fought to get the project away from Weinstein and Miramax, and over to New Line Cinema (where it eventually landed). So he sabotaged the project by leaking the scripts and writer Drew McWeeny, who at the time worked for the extremely popular Ain't It Cool News, read and gave it a positive review. His review and comment that \"this is too short and needs to be three movies with a huge budget\" was a big deal and helped change the playing field for Jackson. The franchise then ended up at New Line with producers who understood the property and weren't just trying to keep an up-and-coming director in their control.", "languages": "English,Sindarin", "budget": 93000000, "runtime": 178}