{"uri": "https://www.imdb.com/title/tt0017925/", "year": 1926, "movieTitle": "The General", "genre": "Action;Adventure;Comedy;Drama;War", "rating": 8.1, "posterUri": "https://m.media-amazon.com/images/M/MV5BYmRiMDFlYjYtOTMwYy00OGY2LWE0Y2QtYzQxOGNhZmUwNTIxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "When Union spies steal an engineer's beloved locomotive, he pursues it single-handedly and straight through enemy lines.", "synopsis": "Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves.", "director": "Clyde Bruckman;Buster Keaton", "writer": "Buster Keaton;Clyde Bruckman", "stars": "Buster Keaton;Marion Mack;Glen Cavender", "trivia": "Based on a true incident during the Civil War. In April 1862, Union agent James J. Andrews led a squad of 21 soldiers on a daring secret raid. Dressed in civilian clothes, Andrews and his men traveled by rail into the Southern states. Their mission was to sabotage rail lines and disrupt the Confederate army's supply chain. At the town of Big Shanty, GA (now known as Kennesaw), the raiders stole a locomotive known as \"General\". They headed north, tearing up track, burning covered bridges, and cutting telegraph lines along the way. William Fuller and Jeff Cain, the conductor and engineer of \"The General,\" respectively, pursued the stolen train by rail and foot. They first used a hand-cart (as Buster Keaton does in the film), then a small work locomotive called \"The Yonah,\" which they borrowed from a railroad work crew, and finally a full-sized Confederate army locomotive called \"Texas,\" which pursued \"General\" for 51 miles--in reverse. During the chase, Confederate soldiers were able to repair the sabotaged telegraph wires and send messages ahead of the raiders. Andrews and his men were intercepted and captured near Chattanooga, TN by a squad of Confederate troops led by Gen. Nathan Bedford Forrest (who, after the war, was one of the early members of the Ku Klux Klan). Tried as spies, Andrews and seven of his raiders were hanged. (A special gallows was built to hold all eight men.) The rest of the raiders were traded in a prisoner exchange. In 1863, the survivors of the mission were awarded the first Medals of Honor. (Andrews and the raiders who had been hanged later received the medal posthumously.) Although this film is a comedy, the incident was later filmed by Walt Disney as a drama, The Great Locomotive Chase (1956), with Fess Parker--a Southerner, born in Texas--as Andrews.", "languages": "None;English", "budget": 750000, "runtime": 67}