{"uri": "https://www.imdb.com/title/tt0110357/", "year": 1994, "movieTitle": "The Lion King", "genre": "Animation;Adventure;Drama;Family;Musical", "rating": 8.5, "posterUri": "https://m.media-amazon.com/images/M/MV5BYTYxNGMyZTYtMjE3MS00MzNjLWFjNmYtMDk3N2FmM2JiM2M1XkEyXkFqcGdeQXVyNjY5NDU4NzI@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.", "synopsis": "A young lion prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young prince must decide his fate: Will he remain an outcast or face his demons and become what he needs to be?", "director": "Roger Allers;Rob Minkoff", "writer": "Irene Mecchi;Jonathan Roberts", "stars": "Matthew Broderick;Jeremy Irons;James Earl Jones", "trivia": "At the time of its production, many at Disney had high hopes for Pocahontas (1995) and deemed the concept of The Lion King (1994) as experimental. Then-studio head Jeffrey Katzenberg regarded Pocahontas as a more prestigious project than \"The Lion King\", and even believed that it had a chance of earning an Academy Award nomination for Best Picture, following in the steps of Beauty and the Beast (1991). As production on the two films went on, \"The Lion King\" finally began to take shape and opinions also began to change. \"The Lion King\" received overwhelmingly positive acclaim from film critics and audiences alike. The film went on to not only become one of the highest-grossing films in cinema history, but also as one of the best selling home video titles of all time. Pocahontas (1995), on the other hand, was less successful commercially than was hoped and received a mixed-to-negative response from film critics. Because the film dealt with more adult themes and tones and featured both a disjointed script and less regard for historical accuracy, it wasn't a mammoth success as the earlier Disney hits had.", "languages": "English;Swahili;Xhosa;Zulu", "budget": 45000000, "runtime": 88}