{"uri": "https://www.imdb.com/title/tt0114709/", "year": 1995, "movieTitle": "Toy Story", "genre": "Animation,Adventure,Comedy,Family,Fantasy", "rating": 8.3, "posterUri": "https://m.media-amazon.com/images/M/MV5BMDU2ZWJlMjktMTRhMy00ZTA5LWEzNDgtYmNmZTEwZTViZWJkXkEyXkFqcGdeQXVyNDQ2OTk4MzI@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.", "synopsis": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that his life (as a toy) is good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.", "director": "John Lasseter", "writer": "John Lasseter,Pete Docter", "stars": "Tom Hanks,Tim Allen,Don Rickles", "trivia": "The design that Pixar used for Mr. Potato Head is an altered version of the 1980s and 90s design. For instance, in the real world, the toy Mr. Potato Head's eyes are attached to each other with only one hole on the plastic potato to put them in. In the Toy Story films, Mr. Potato Head's eyes are separate and have one hole for each eye on the plastic body to place them in (this is true for the shoes as well). That's why the Toy Story Collection version has connected eyes, in which the eye connection is a \"half inaccuracy.\" The collectors were not pleased. However, we may see more accurate versions in the near future, as Hasbro announced that they may make revisions to their design.", "languages": "English", "budget": 30000000, "runtime": 81}