{"uri": "https://www.imdb.com/title/tt0052357/", "year": 1958, "movieTitle": "Vertigo", "genre": "Mystery,Romance,Thriller", "rating": 8.3, "posterUri": "https://m.media-amazon.com/images/M/MV5BYTE4ODEwZDUtNDFjOC00NjAxLWEzYTQtYTI1NGVmZmFlNjdiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg", "summary": "A former police detective juggles wrestling with his personal demons and becoming obsessed with a hauntingly beautiful woman.", "synopsis": "Following his early retirement as a detective from the San Francisco Police Department, John Ferguson - Scottie to his friends - becomes obsessed with two women in succession, those obsessions which trouble his long time friend and former fiancée, Midge Wood, a designer of women's undergarments. The first is wealthy and elegant platinum blonde Madeleine Elster, the wife of his college acquaintance Gavin Elster, who hires John to follow her in Gavin's belief that she may be a danger to herself in thinking that she has recently been possessed by the spirit of Carlotta Valdes, Madeleine's great-grandmother who she knows nothing about, but who Gavin knows committed suicide in being mentally unbalanced when she was twenty-six, Madeleine's current age. The second is Judy Barton, who John spots on the street one day. Judy is a working class girl, but what makes John obsessed with her is that, despite her working class style and her brunette hair, she is the spitting image of Madeleine, into ...", "director": "Alfred Hitchcock", "writer": "Alec Coppel,Samuel A. Taylor", "stars": "James Stewart,Kim Novak,Barbara Bel Geddes", "trivia": "Costume designer Edith Head and director Alfred Hitchcock worked together to give Madeleine's clothing an eerie appearance. Her trademark gray suit was chosen for its color because they thought it seemed odd for a blonde woman to be wearing all gray. Also, they added the black scarf to her white coat because of the odd contrast. But when Kim Novak reported for filming, according to Hitchcock, she had \"all sorts of preconceived notions\" about her character, including what she would and would not wear. Before shooting began, she told the director she did not like the grey suit and black shoes she was slated to wear, thinking them too heavy and stiff for her character. Novak later recalled, \"I didn't think it would matter to him what kind of shoes I wore. I had never had a director who was particular about the costumes, the way they were designed, the specific colors. The two things he wanted the most were those shoes and that gray suit.\" Hitchcock explained to Novak that the visual aspect of the film was even more important to him than the story, and insisted on her wearing the suit and the shoes that he had been planning for several months. Novak learned to make it work for her, as she saw it a symbol of her character.", "languages": "English", "budget": 2479000, "runtime": 128}